<html>

<head>
<meta http-equiv="Content-Language" content="tr">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-9">
<title>nedir</title>
<style type="text/css">
body,td,th {
	color: #FFF;
}
</style>
</head>

<body background="resimler/wallhaven-90049.jpg"><p>
<marquee behavior="alternate" scrollamount="10" scrolldelay="5" style="font-family: Monotype Corsiva; color: #FFFFFF; font-size: 36pt; font-style: italic; font-weight: bold">BÝLGÝSAYAR MÜHENDÝSLÝÐÝ NEDÝR</marquee></p>
<p><a href="index.html"><img border="0" id="img1" src="iletisim_button5.jpg" height="20" width="100" alt="ANASAYFA" onmouseover="FP_swapImg(1,0,/*id*/'img1',/*url*/'file:///C:/Users/acer/AppData/Local/Microsoft/Windows/INetCache/FrontPageTempDir/button6.jpg')" onmouseout="FP_swapImg(0,0,/*id*/'img1',/*url*/'file:///C:/Users/acer/AppData/Local/Microsoft/Windows/INetCache/FrontPageTempDir/button5.jpg')" onmousedown="FP_swapImg(1,0,/*id*/'img1',/*url*/'file:///C:/Users/acer/AppData/Local/Microsoft/Windows/INetCache/FrontPageTempDir/button7.jpg')" onmouseup="FP_swapImg(0,0,/*id*/'img1',/*url*/'file:///C:/Users/acer/AppData/Local/Microsoft/Windows/INetCache/FrontPageTempDir/button6.jpg')" fp-style="fp-btn: Embossed Capsule 3" fp-title="ANASAYFA" /></a></p>
<div>
  <div>
    <div>
      <div>
        <div>
          <div>
            <p align="justify"> Bilgisayar M&uuml;hendisliði donaným ve yazýlým alanýnda karþýlaþýlan algoritmik s&uuml;re&ccedil;lerin uygulamalarýný i&ccedil;eren bir m&uuml;hendislik dalýdýr. Bunun yaný sýra teknolojik, ekonomik, bilimsel ve sosyal alanlarda karþýlaþýlan problemlere &ccedil;&ouml;z&uuml;mler &uuml;retir. &Ouml;ðrencilerin bu disiplin i&ccedil;inde eðitim aldýklarý d&ouml;rt ana konu vardýr: teori, soyutlama, tasarým ve pratik. Teori hesaplama konusunun matematiksel ve bilimsel altyapýsýný saðlar. Soyutlama algoritmalarýn, veri yapýlarýnýn, donaným mimarisinin modellenmesi prensiplerini i&ccedil;erir. Tasarým ve pratik ise donaným-yazýlým sistemlerinin geliþtirilmesinde gerekli olan ara&ccedil;larýn ve teorinin kullanýlmasýný anlatýr. Bu ara&ccedil;lar arasýnda programlama dilleri, veri tabanlarý, að protokolleri, istemci/sunucu mimarisi, yapay zeka v.b. sayýlabilir. Bilgisayar M&uuml;hendisliði programlarý temel bilimler, temel m&uuml;hendislik, sosyal bilimler ve bilgisayar bilimleri derslerini i&ccedil;erir. Bilgisayar M&uuml;hendisliði temeli, teori, programlama, bilgisayar organizasyonu, sayýsal tasarým, n&uuml;merik analiz, algoritmalar ve veri yapýlarý derslerinde verilir. Ýleri sýnýflarda ise iþletim sistemleri tasarýmý, veritabaný uygulamalarý, bilgisayarla grafik, bilgisayar mimarisi, mikro iþlemciler, programlama dillerinin &ouml;zellikleri, nesneye y&ouml;nelik programlama y&ouml;ntemleri ve yazýlým m&uuml;hendisliði konularý iþlenir. Son sýnýf &ouml;ðrencileri yaratýcýlýklarýný, bilgi ve motivasyonlarýný en son teknoloji ile birleþtirerek bir bitirme projesi hazýrlarlar.</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</div>
<p align="center">&nbsp;</p>
</body>

</html>
